In [5]:
import pandas as pd

student_dict = {
                'Name': ['Joe', 'Nat', 'Harry','Jack','Jose','Jill','Rose'],
                'Age': [20,21,19,17,18,19,17],
                'Marks': [85.10, 77.80, 91.54, 72, 87.9, 90, 72]
                }

# create DataFrame from dict
student_df = pd.DataFrame(student_dict)
student_df

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
3   Jack   17  72.00
4   Jose   18  87.90
5   Jill   19  90.00
6   Rose   17  72.00

In [10]:
# display first 5 rows

topRows = student_df.head()
topRows

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
3   Jack   17  72.00
4   Jose   18  87.90

In [8]:
# display first 3 rows

topRows = student_df.head(3)
topRows

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54

In [11]:
# display rows except bottom 2 rows

topRows = student_df.head(-2)
print(topRows)

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
3   Jack   17  72.00
4   Jose   18  87.90